[{"title":"cat like coding翻译系列开篇","date":"2022-08-29T05:13:55.000Z","path":"2022/08/29/cat like coding翻译系列开篇/","text":"一直在学习Unity，但是感觉没有学习到很深入的东西，所以想通过某个系列来增加自己对Unity的理解，所以这里专门开了一个翻译catlikecoding的系列，希望可以增加自己的理解。 主要内容包括了： Basics Pseudorandom Noise Procedural Meshes Pseudorandom Surfaces Movement Object Management Tower Defense Flow Mesh Basics Custom SRP Scriptable Render Pipeline Rendering Advanced Rendering Hex Map Marching Squares Old Tutorials 先立个flag，希望可以慢慢的完善这个系列的内容","link":"","tags":[{"name":"Unity","slug":"Unity","permalink":"https://tinson1989.github.io/tags/Unity/"}]},{"title":"主程手记-软件架构","date":"2022-08-04T01:27:17.000Z","path":"2022/08/04/主程手记-软件架构/","text":"一年多没有接触u3d了，难得有时间，重新回顾一下这块内容吧。 说到底，游戏也是一个软件，只是和传统行业不一样的是，游戏需求的要求更高一些，需要在表现上得到更多的表现，而作为一个软件，常用的特性主要有： 承载力 可拓展性 易用性 可伸缩性 容错性以及错误的感知力 对于游戏而言，承载力最直接的表现就是帧率，我们要在一个tick里面表现出很多的东西，但是资源是有限的，我们需要在这有限的资源里，展示最丰富的东西，这样也会引起另一个问题，就是卡顿，所以这也是前端性能优化最重要的一个部分了。而扩展性就是我们根据游戏的品类，添加一个新的模块，怎样快速添加呢，这就是拓展性的重要性。易用性，当然说的就是在各种接口调用的时候的便利了，如果调用一个接口，通过重重的接口和开关，这样是不便于使用的。 文章说到的最重要的能力就是抽象能力，我们就是要把现实世界，抽象成我们的数字世界，逻辑越简单，后面引起的bug越少。而抽象能力主要包含了： 分层思维 分治思维 演化思维 作为U3D的使用者，我们当然是要对这个引擎搭建框架了。用分层思维，主要框架分为： 网络层 http udp tcp 数据管理层 内存数据 外部数据 数据表 资源管理层 Assertbundle prefab 核心逻辑层 工具编辑器 角色行为框架 AI框架 地图场景与寻路框架 着色器与特效 设备平台 物理模拟 UI框架层","link":"","tags":[{"name":"Unity3D","slug":"Unity3D","permalink":"https://tinson1989.github.io/tags/Unity3D/"}]},{"title":"离职后的第三天","date":"2022-08-03T08:18:54.000Z","path":"2022/08/03/离职后的第三天/","text":"中年失业，这一直以为是一个词语罢了，没想到，降落在自己的身上了，今天是第三天了，也尝试去面试了，但是貌似还没有好的结果。 你问我怕不怕，其实还真的没什么好怕的，对于上一份工作，也许觉得遗憾，没有做出什么成绩，但是这里的管理，流程以及行政，都让人觉得不爽，但是貌似也不能主动离开，没有好的地方可以去，而公司提出的N+1，也许真的是一个比较好的解决方案，对自己而言，也算是比较好的归处吧。从去年离职到入职，没有休息，因为怕，怕交不起房贷，所以在找到工作之后，才去辞职，但是这边比较急，在2021年6月30日离职之后，2021年7月1日就入职新公司了，这是一个引擎开发的岗位，也是一个新的尝试，主要是希望可以从底层更多的去了解一些游戏引擎，当然，也是希望可以得到更多的收入。入职的时候环境氛围还是不错的，有时间去熟悉代码，然后慢慢的从框架上去了解整个引擎的框架，在两周后就开始找点bug，慢慢的从各个方面去熟悉引擎。那时候还没有明确的分工，我就在看代码的时候，协助畅哥完成代码的优化，但是这边各个方面都是比较乱的，连编辑器引擎交互的框架也是刚搭建完，所以性能还没有得到很好的改善，而我就是这时候去做一些杂事。其次就是来一个比较明确的模块，地形，应该说是体素地形吧，也是我在这里的第一个大模块。说实话，这各模块说难确实难，主要包含了三部分，引擎逻辑，渲染逻辑以及编辑器相关的功能，而我主要是负责引擎的逻辑部分，具体的功能这里就不描述了，后续会写对应的文章来详细描述一下。再后来就是开始接触性能优化，对游戏，编辑器的静态合批，然后开始对游戏的性能优化，忙忙碌碌的加了一个月的班，然后又开始新的功能，然后就被约谈，解除合约了。这几天开始尝试去找工作，但是我也不着急，主要是慢慢来，想要想清楚自己未来的路要怎么走，是不是还是要一直在游戏行业待呢？感觉接下来要做的几件事情： 把自己的知识树梳理一边 完善渲染这块的知识 深入剖析unity的源码 对于现在的工作，还是很感激，有这么一个机会接触到引擎开发岗，就用这么一篇文章总结过去一年的工作，接下来还是要往前走。","link":"","tags":[{"name":"工作","slug":"工作","permalink":"https://tinson1989.github.io/tags/%E5%B7%A5%E4%BD%9C/"}]}]